<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Generated based on keeleysam-recipes/SurteesStudios/Bartender.download.recipe</string>
	<key>Description</key>
	<string>Downloads the latest version of ProPresenter.</string>
	<key>Identifier</key>
	<string>com.github.comebacktomorrow.download.ProPresenter7</string>
	<key>Input</key>
	<dict>
    	 <key>NAME</key>
     	<string>ProPresenter</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>RenewedVisionAPIProvider</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
		 <dict>
			 <key>Processor</key>
			 <string>EndOfCheckPhase</string>
		 </dict>
		 <dict>
			 <key>Arguments</key>
			 <dict>
				 <key>input_path</key>
				 <string>%RECIPE_CACHE_DIR%/Applications/%NAME%/ProPresenter.app</string>
				 <key>requirement</key>
				 <string>anchor apple generic and identifier "com.renewedvision.propresenter" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "97GAAZ6CPX")</string>
			 </dict>
			 <key>Processor</key>
			 <string>CodeSignatureVerifier</string>
		 </dict>
	 </array>
 </dict>
</plist>