<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ProPresenter disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.comebacktomorrow.munki.ProPresenter7</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ProPresenter 7</string>
		<key>MUNKI_CATEGORY</key>
		<string>Video</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/renewedvision/propresenter7</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Renewed Vision</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ProPresenter is the definitive choice in live presentation and worship software for churches, schools, business presentations, and concerts</string>
            <key>display_name</key>
            <string>ProPresenter 7</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>icon_name</key>
			<string>%NAME%</string>
            <key>minimum_os_version</key>
			<string>10.12</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash

if [[ -f "/Library/LaunchDaemons/com.renewedvision.InstallHelper.plist" ]]; then
    launchctl unload -w "/Library/LaunchDaemons/com.renewedvision.InstallHelper.plist" 2&gt;/dev/null
    rm -rf "/Library/LaunchDaemons/com.renewedvision.InstallHelper.plist"
fi

rm -rf "/Applications/ProPresenter.app"
rm -rf "/Library/PrivilegedHelperTools/com.renewedvision.InstallHelper"
</string>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.comebacktomorrow.pkg.ProPresenter7</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>