<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Synology Drive.

</string>
    <key>Identifier</key>
    <string>com.github.comebacktomorrow.download.synology_drive</string>
    <key>Input</key>
    <dict>
        <key>PRODUCT_NAME_PATTERN</key>
        <string>Synology Drive Client</string>
        <key>NAME</key>
        <string>Synology Drive Client</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SynologyURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_name</key>
                <string>Synology Drive</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>   
		    <key>Processor</key>   
		    <string>CodeSignatureVerifier</string>   
		    <key>Arguments</key>   
		    <dict>   
		        <key>input_path</key>   
		        <string>%pathname%/Install Synology Drive Client.pkg</string>
		        <key>expected_authority_names</key>
		        <array>
		            <string>Developer ID Installer: Synology Inc. (X85BAK35Y4)</string>
		            <string>Developer ID Certification Authority</string>
		            <string>Apple Root CA</string>
		        </array>
		    </dict>
		</dict>
    </array>
</dict>
</plist>