<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Senneheiser Wireless Systems Manager.</string>
	<key>Identifier</key>
	<string>com.github.comebacktomorrow.download.SennheiserWSM</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>WSM</string>
		<key>NAME</key>
		<string>Wireless Systems Manager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://en-us.sennheiser.com/service-support-services-wireless-systems-manager</string>
				<key>re_pattern</key>
				<string>(?:(macOS\n.[a-z].*))global_downloads/(\d\d\d\d)/agreement</string>
				<key>result_output_var_name</key>
				<string>fileid</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://en-us.sennheiser.com/service-support-services-wireless-systems-manager</string>
				<key>re_pattern</key>
				<string>(?:Version )(.*)(?: - macOS)</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://en-us.sennheiser.com/global_downloads/%fileid%/agreement</string>
				<key>re_pattern</key>
				<string>(http://[a-z].*dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
