<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Generated based on keeleysam-recipes/SurteesStudios/Bartender.download.recipe</string>
	<key>Description</key>
	<string>Downloads the latest version of ProPresenter 6.</string>
	<key>Identifier</key>
	<string>com.github.comebacktomorrow.download.ProPresenter6</string>
	<key>Input</key>
	<dict>
    	 <key>NAME</key>
     	<string>ProPresenter 6</string>
     	<key>SPARKLE_FEED_URL</key>
     	<string>https://www.renewedvision.com/update/ProPresenter6.php</string>
	 	<key>USER_AGENT</key>
	 	<string>Mozilla/5.0</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_request_headers</key>
			  	<dict>
				  	<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
			  	<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
				<key>pkginfo_keys_to_copy_from_sparkle_feed</key>
				<array>
					<string>minimum_os_version</string>
					<string>version</string>
				</array>
		  	</dict>
		 	<key>Processor</key>
		 	<string>SparkleUpdateInfoProvider</string>
	 	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
		 		<key>request_headers</key>
		 		<dict>
		 			<key>user-agent</key>
		 			<string>%USER_AGENT%</string>
		 		</dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
		 	</dict>
			<key>Processor</key>
		 	<string>URLDownloader</string>
		 </dict>
		 <dict>
			 <key>Processor</key>
			 <string>EndOfCheckPhase</string>
		 </dict>
		 <dict>
			 <key>Arguments</key>
			 <dict>
				 <key>input_path</key>
				 <string>%pathname%/%NAME%.app</string>
				 <key>requirement</key>
				 <string>anchor apple generic and identifier "com.renewedvision.ProPresenter6" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "97GAAZ6CPX")</string>
			 </dict>
			 <key>Processor</key>
			 <string>CodeSignatureVerifier</string>
		 </dict>
	 </array>
 </dict>
</plist>