<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ProPresenter disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.comebacktomorrow.munki.ProPresenter6</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ProPresenter 6</string>
		<key>MUNKI_CATEGORY</key>
		<string>Video</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/renewedvision/propresenter6</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Renewed Vision</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ProPresenter is the definitive choice in live presentation and worship software for churches, schools, business presentations, and concerts</string>
            <key>display_name</key>
            <string>ProPresenter 6</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>icon_name</key>
			<string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.comebacktomorrow.download.ProPresenter6</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/ProPresenter 6.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pathname%/ProPresenter 6.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>shortversion</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
	    <dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%shortversion%.%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>