<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent version of Desktop Video and imports it into Munki.

</string>
    <key>Identifier</key>
    <string>com.github.comebacktomorrow.munki.blackmagicdesign_desktopvideo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Desktop Video</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/blackmagicdesign/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Desktop Video is the driver used for Blackmagic Design Ultrastudio, Decklink and Intensity products used for broadcast video capture and playback.</string>
            <key>display_name</key>
            <string>Desktop Video</string>
            <key>minimum_os_version</key>
            <string>10.10.0</string>
            <key>name</key>
            <string>%NAME%</string>
			<key>uninstallable</key>
			            <true/>
			            <key>uninstall_method</key>
			            <string>uninstall_script</string>
			            <key>uninstall_script</key>
			            <string>#!/bin/sh
			            # Run the uninstaller script provided with the app.
			            # Alternatively, replace this with your own version of their uninstaller.
			            # For example, their uninstaller intentionally leaves the following on the
			            # system, which you may disagree with:
			            # - /Library/Application Support/Blackmagic Design/DaVinci Resolve
			            # - /Library/Preferences/Blackmagic Design/DaVinci Resolve
			            #
			            # Their uninstaller is also executable and world-writable.

			            UNINSTALL_SCRIPT="/Applications/Blackmagic Desktop Video/Uninstall Desktop Video.app"

			            [ -x "${UNINSTALL_SCRIPT}" ] || exit 1
			            "${UNINSTALL_SCRIPT}"
			            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.comebacktomorrow.download.blackmagicdesign_desktopvideo</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unzip/*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>