<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Smaart V8 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.comebacktomorrow.munki.SmaartV8</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Smaart 8</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/rationalacoustics/smaartv8</string>
		<key>NAME</key>
		<string>Smaart</string>
		<key>MUNKI_CATEGORY</key>
		<string>Audio</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A software suite of audio and acoustic measurement tools, for the analysis portion of acoustical measurements and instrumentation.</string>
			<key>developer</key>
			<string>Rational Acoustics</string>
			<key>display_name</key>
			<string>Smaart V8</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.comebacktomorrow.download.SmaartV8</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>