<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ProVideoServer Version 3 and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.comebacktomorrow.munki.ProVideoServer3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ProVideoServer</string>
		<key>MUNKI_CATEGORY</key>
		<string>Video</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/renewedvision/provideoserver</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Renewed Vision</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Easy to use and affordable 4-channel Video Playout Server with Ingest</string>
            <key>display_name</key>
            <string>ProVideoServer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.comebacktomorrow.pkg.ProVideoServer3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>